Bot_Token = "TOKEN" 
'------------------------------------------------------------------------------------------------------------------------------------'
crypto_info_fa = {
    'ارز دیجیتال چیست ؟ 🤔' :'ارز دیجیتال چیست؟\nارز رمزنگاری شده یک ارز دیجیتال یا مجازی است که توسط رمزنگاری ایمن می شود و تقلبی یا دو برابری آن را تقریبا غیرممکن می کند. بسیاری از ارزهای دیجیتال شبکه‌های غیرمتمرکز مبتنی بر فناوری بلاک چین هستند - دفتر کل توزیع‌شده که توسط شبکه‌ای متفاوت از رایانه‌ها اجرا می‌شود. یکی از ویژگی‌های مشخص ارزهای دیجیتال این است که معمولاً توسط هیچ مرجع مرکزی صادر نمی‌شوند و از نظر تئوری از دخالت یا دستکاری دولت مصون می‌مانند.',
    'ارز دیجیتال ها چگونه کار می کنند؟ 🤯' :'ارز دیجیتال ها چگونه کار می کنند؟\nارزهای رمزنگاری شده بر روی یک دفتر کل توزیع شده به نام بلاک چین اجرا می شوند، رکوردی از تمام تراکنش های به روز شده و نگهداری شده توسط دارندگان ارز. واحدهای ارز دیجیتال از طریق فرآیندی به نام ماینینگ ایجاد می‌شوند که شامل استفاده از نیروی کامپیوتری برای حل مسائل پیچیده ریاضی است که مقداری از آن ارز را به عنوان دستمزد به شما می دهد. کاربران همچنین می توانند ارزها را از کارگزاران خریداری کنند، سپس آنها را با استفاده از کیف پول های رمزنگاری ذخیره و خرج کنند. اگر صاحب ارز دیجیتال هستید، هیچ چیز ملموسی ندارید. آنچه شما دارید کلیدی است که به شما امکان می دهد رکورد یا واحد اندازه گیری را بدون شخص ثالث قابل اعتماد از یک شخص به فرد دیگر منتقل کنید. اگرچه بیت کوین از سال 2009 وجود داشته است، ارزهای دیجیتال و کاربردهای فناوری بلاک چین هنوز از نظر مالی در حال ظهور هستند. و استفاده های بیشتری در آینده انتظار می رود. معاملات از جمله اوراق قرضه، سهام و سایر دارایی های مالی را می توان در نهایت با استفاده از این فناوری انجام داد.',
    'چگونه ارز دیجیتال بخریم؟ 😎' : 'چگونه ارز دیجیتال بخریم؟\n1- برای درک بهتر کریپتو تحقیق کاملی انجام دهید. \n2- صرافی قابل اعتمادی را انتخاب کنید که بتوانید در آن ارزهای دیجیتال بخرید.\n3- پس از انتخاب صرافی و ایجاد حساب در آن، می توانید مقدار پولی را که می خواهید سرمایه گذاری کنید  به صرافی واریز کنید و ارزهای دیجیتال  را وارد حساب خود کنید.\n4-برای سرمایه گذاری روی ارزها، حتماً در مورد ارزی که می خواهید روی آن سرمایه گذاری کنید تحقیق کنید.\n5-و در نهایت برای ذخیره ارزهای خود می توانید از کیف پول دیجیتالی که در حساب صرافی خود یا از کیف پول های دیجیتالی مختلفی که به عنوان برنامه بر روی دستگاه خود نصب می کنید استفاده کنید (قبل از استفاده از کیف پول در مورد آن تحقیق کافی انجام دهید).',
    'نحوه حمایت مالی با استفاده از ارز دیجیتال ؟ 🤑' : 'نحوه حمایت مالی با استفاده از ارز دیجیتال ؟ \n1- ارز مورد نظر خود را مثلا (BTC) انتخاب کنید.\n2- آدرس کیف پولی را که می خواهید به آن واریز کنید وارد کنید.\n3- مطمئن شوید که شبکه ارزی مثلا (TRC 20) مشابه شبکه ارز است که می خواهید به آن واریز انجام دهید .\n4- در نهایت مقدار ارزی را که می خواهید واریز کنید انتخاب کنید و مراحل تایید را تکمیل کنید.'
}

'------------------------------------------------------------------------------------------------------------------------------------'
Bot_Info_fa = {
    '🤖 معرفی ربات 🤖': "سلام اسم من Yahoo Finance Bot 🤖 . \n من میتونم قیمت بورس های بین المللی را بهتون بگم,بعلاوه قیمت بورس میتونم قیمت ارز های دیجیتال رو هم بهتون بگم و قتی قیمت هارو دریافت کردید روی دکمه آخرین اخبار کلیک کنید میتونید اخرین اخبار در مورد ارز دیجیتال یا شرکت مورد نظرتون رو دریافت کنید . \nو میتونم چک کنم که تراکنش کریپتو ای را که انجام داده اید موفقیت امیز بوده یا نه .".title(),
    '🗂 اگر اطلاعات بیشتری نیاز دارید 🗂 \n📨 با ما ارتباط برقرار کنید 📨':'📧 Email :\nYahoo_Finance_Bot@Live_Information.co',   
}
'------------------------------------------------------------------------------------------------------------------------------------'

bot_kaywords_fa = ("📊 قیمت بورس 📊\nبا کمک این کلید و دستورالعمل هایی که توضیح داده شد می توانید قیمت سهام شرکت مورد علاقه خود را به صورت لحضه ای دریافت کنید.\n--------------------------------------------------------------------\n💵 قیمت ارزهای دیجیتال 💵\nبا کمک این کلید و دستورالعمل های توضیح داده شده، می توانید قیمت ارز دیجیتال مورد علاقه خود را به صورت لحضه ای دریافت کنید.\n--------------------------------------------------------------------\n📒 فهرست اطلاعات 📒\nلیستی از سوالات برای کسانی که نیاز به اطلاعات بیشتر دارند تهیه شده است که با کلیک بر روی سوال مورد نظر پاسخ آن سوال را دریافت خواهید کرد.\n--------------------------------------------------------------------\n👨🏻‍💻 تراکنش های کریپتوای را بررسی کنید 👨🏻‍💻\nاین کلید به شما کمک می کند تا بررسی کنید که آیا معامله ای که انجام داده اید موفقیت آمیز بوده است یا خیر. این برای دو نوع شبکه طراحی شده است، {TRON(TRC20)، Ethereum(ERC20)}.\n--------------------------------------------------------------------")
     

curences_list_r_from_config_fa = {

    'انگلستان(پوند)':'GBP=X',
    'آلمان(یورو)':'EUR=X',
    'ایالات متحده(دلار)':'USD',
    'کره جنوبی(وون)':'KRW=X',
    'ژاپن(ین)':'JPY=X',
    'چین(یوان)':'CNH=X',
    'هند(روپیه)':'INR=X',
    'روسیه(روبل)':'RUB=X',
    'ایران(تومان)' : 'IRT'


    
}
curences_list_from_config_fa = {

    'انگلستان(پوند)':'پوند',
    'آلمان(یورو)':'یورو',
    'ایالات متحده(دلار)':'دلار',
    'کره جنوبی(وون)':'وون',
    'ژاپن(ین)':'ین',
    'چین(یوان)':'یوان',
    'هند(روپیه)':'روپیه',
    'روسیه(روبل)':'روبل',
    'ایران(تومان)' : 'تومان'

}



def info_crypto(crypto_name) :

    import requests
    from bs4 import BeautifulSoup 
    symbol = (crypto_name+'-usd').upper()

    agent = 'Mozilla/5.0 (Macintosh; Intel Mac OS X 11_5) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/14.1.2 Safari/605.1.15'
    headers = {'User-Agent': agent}
    try :
        url = f'https://finance.yahoo.com/quote/{symbol}/profile?p={symbol}'
        response = requests.get(url, headers=headers)
        response = (response.text)
        soup = BeautifulSoup( response , 'html.parser')
    except :
        d =''
    
    try :
        dis = soup.find(class_ ='Pb(30px) smartphone_Px(20px)').find_all("div", string=True)
        dis = str(dis[0]).replace('<div data-test="prof-desc">','').replace('</div>','')
    except :
        d = ''
    
    site = dis.split()[-1]
    site = site.replace('/.','')

    name = dis.split()[0]
    try :
        url2 = f'https://finance.yahoo.com/quote/{symbol}?p={symbol}'
        response2 = requests.get(url2, headers=headers)
        response2 = (response2.text)
        soup2 = BeautifulSoup( response2 , 'html.parser')
    except :
        d =''
    try : 
        market_cap = str(soup2.find(class_='D(ib) W(1/2) Bxz(bb) Pstart(12px) Va(t) ie-7_D(i) ie-7_Pos(a) smartphone_D(b) smartphone_W(100%) smartphone_Pstart(0px) smartphone_BdB smartphone_Bdc($seperatorColor)').find(class_='Ta(end) Fw(600) Lh(14px)'))
        market_cap = market_cap.replace('<td class="Ta(end) Fw(600) Lh(14px)" data-test="MARKET_CAP-value">','').replace('</td>','')
    except :
        d = ''
    info = {'site' : site , 'name' : name , 'market_cap' : market_cap + ' USD'} 

    try:
        return info
    except:
        d = ''



def info_stock(stock_name) :
    import requests
    from bs4 import BeautifulSoup 
    symbol = (stock_name).upper()

    agent = 'Mozilla/5.0 (Macintosh; Intel Mac OS X 11_5) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/14.1.2 Safari/605.1.15'
    headers = {'User-Agent': agent}
    try :
        url = f'https://finance.yahoo.com/quote/{symbol}/profile?p={symbol}'
        response = requests.get(url, headers=headers)
        response = (response.text)
        soup = BeautifulSoup( response , 'html.parser')
    except :
        d =''
    
    dis = soup.find(class_ = 'asset-profile-container')

    name = str(dis.find(class_='Fz(m) Mb(10px)')).replace('<h3 class="Fz(m) Mb(10px)">','').replace('.</h3>','')

    site = str(dis.find(class_='D(ib) W(47.727%) Pend(40px)').find_all(class_='C($linkColor)')[1]).replace('<a class="C($linkColor)" href="','').split('"')[0]
    
    country = str(dis.find(class_ ='D(ib) W(47.727%) Pend(40px)')).split('<br/><a class="C($linkColor)"')[0].split('<br/>')[-1]

    try :
        url2 = f'https://finance.yahoo.com/quote/{symbol}?p={symbol}'
        response2 = requests.get(url2, headers=headers)
        response2 = (response2.text)
        soup2 = BeautifulSoup( response2 , 'html.parser')
    except :
        d =''
    try : 
        market_cap = str(soup2.find(class_='D(ib) W(1/2) Bxz(bb) Pstart(12px) Va(t) ie-7_D(i) ie-7_Pos(a) smartphone_D(b) smartphone_W(100%) smartphone_Pstart(0px) smartphone_BdB smartphone_Bdc($seperatorColor)').find(class_='Ta(end) Fw(600) Lh(14px)'))
        market_cap = market_cap.replace('<td class="Ta(end) Fw(600) Lh(14px)" data-test="MARKET_CAP-value">','').replace('</td>','')
    except :
        d = ''
    info = {'site' : site , 'name' : name , 'market_cap' : market_cap +' USD','country' : country} 

    try  :
        return info

    except :
        d = ''



